// написать программу которая принимает два числа и выведит каоке число больше какое меньше
int a = 5;
int b = 7;
int max = 7;
if(a > b)
{
    Console.WriteLine("5>7");
}
else
{
    Console.WriteLine("Ответ 7>5");
}    